{
    "nav__link-1": ["Discover", "Tutustu"],
    "nav__link-2": ["Skills", "Osaaminen"],
    "nav__link-3": ["Projects", "Projektit"],
    "nav__link-4": ["Contact", "Ota yhteyttä"],

    "header__button": ["Discover", "Tutustu"],

    "about__h2": ["Web Design and software development", "Web-kehitystä ja ohjelmistosuunnittelua"],
    "about__h3": ["Who am I?", "Kuka olen?"],
    "about__p1": ["I'm a 25-year-old web-developer from Jyväskylä, who's interested to work in web- or software development. I currently work as a WordPress/Web Developer in a marketing agency. I graduated as a Bachelor of Business Administration in 2018. In my freetime I have self-studied modern web technologies, for example React, Sass and modern CSS. Previously I graduated as a media-assistant, where I focused my studies on graphic design.", 
        "Olen 25-vuotias koodari Jyväskylästä, joka on kiinnostunut työskentelemään web- ja ohjelmistokehityksen parissa. Työskentelen tällä hetkellä WordPress/Web-kehittäjänä mainostoimistossa. Valmistuin tietojenkäsittelyn tradenomiksi vuonna 2018. Vapaa-ajalla olen opiskellut itsenäisesti moderneja teknologioita, kuten Reactia, Sassia, sekä MERN-stackin käyttöä. Aiemmin opiskelin media-assistentiksi, jolloin painotin graafiseen suunnitteluun, joten minulta löytyy myös visuaalista silmää."],
    "about__p2": ["In my freetime I spend my time on my computer coding and gaming. Also I go to the gym and knit awesome socks and mittens.",
        "Vapaa-ajallani käytän aikaani monipuolisesti tietokoneen ääressä koodaillen ja pelaillen. Lisäksi käyn kuntosalilla, liikun luonnossa ja neulon pirun hienoja villasukkia."],
    "about__button": ["Learn more", "Lue lisää"],

    "popup__h2": ["Who am I?", "Kuka olen?"],
    "popup__h3-1": ["Work", "Työkokemus"],
    "popup__text-1": ["In my current job I have created many diverse websites and WooCommerce-stores. I have also gained a lot of experience in working directly with customers. In my work I have used for example VueJs to create different functionalities and I have worked with APIs.", 
        "Nykyisessä työssäni olen tehnyt monipuolisia verkkosivuja ja WooCommerce-verkkokauppoja. Myös asiakasrajapinnassa työskentely on tullut hyvin tutuksi. Tekemieni verkkosivujen ja -palveluiden toiminnallisuuksien teossa olen käyttänyt muun muassa Vue.js:ssää. Erilaisten rajapintojen käyttö on myös tuttua. Tekemäni projektit ovat vaihdelleet pienistä saiteista suurempiin kokonaisuuksiin. Tämän kevään aikana myös etätyöskentely on tullut entistä tutummaksi ja ajankäytön hallinta on kehittynyt entisestään. "],
    "popup__h3-2": ["Education", "Koulutus"],
    "popup__text-2": ["I studied programming in Karelia University of Applied Sciences from 2014 to 2018. I focused my studies in game programming, but during my studies I became more fond of web-development. I was an intern in a marketing agancy, where I got to learn WordPress-development. I also did my <a href='http://www.theseus.fi/handle/10024/139510' target='_blank'>bachelor's thesis</a> as a commission to the place I interned in. In my thesis I created a multipurpose child theme to web-store and also got to know WooCommerce in practice. On my freetime I've been practicing coding by watching some web-courses and doing little projects. Recently I have been learning <a href='https://www.udemy.com/react-the-complete-guide-incl-redux/' target='_blank'>React</a> and using the <a href='https://www.udemy.com/react-nodejs-express-mongodb-the-mern-fullstack-guide/' target='_blank'>MERN-stack</a>.",
        "Opiskelin tietojenkäsittelyä Karelia-ammattikorkeakoulussa vuosina 2014-2018. Painotin opintoni peliohjelmointiin, mutta opintojeni aikana mielenkiintoni kääntyikin web-kehityksen suuntaan. Suoritinkin harjoitteluni markkinointitoimistossa, jossa pääsin tutustumaan WordPress-kehitykseen. Tein <a href='http://www.theseus.fi/handle/10024/139510' target='_blank'>opinnäytetyöni </a> toimeksiantona harjoittelupaikkaani. Työssä toteutin monikäyttöisen lapsiteeman verkkokaupalle, sekä tutustuin myös käytännössä WooCommercen käyttöön. Vapaa-ajallani olen harjoitellut eri teknologioiden käyttöä nettikurssien avulla ja tehden pieniä projekteja, joista tämä portfolio-sivu on yksi esimerkki. Viimeisimpänä olen opiskellut <a href='https://www.udemy.com/react-the-complete-guide-incl-redux/' target='_blank'>Reactia</a> ja <a href='https://www.udemy.com/react-nodejs-express-mongodb-the-mern-fullstack-guide/' target='_blank'>MERN-stackin</a> käyttöä."],
    "popup__h3-3": ["What I want from my job?", "Mitä haluan työltäni?"],
    "popup__text-3": ["I want to develop into a multi-skilled professional, who can provide knowledge for employers and customers in many different areas. I am most interested in Front-end development, but I am also interested in back-end and my long time goal is to develop into a Fullstacker.",
        "Tulevalta työltäni toivon ennen kaikkea sitä, että pääsisin osaksi tiimia, jossa voisin kehittää itseäni alan ammattilaisena. Työelämän päätavoitteeni on kehittyä moniosaavaksi ammattilaiseksi, joka kykenee tarjoamaan työnantajalle ja asiakkaalle osaamistaan monilla eri osa-alueilla. Eniten minua kiinnostaa Front-end-kehitys, mutta olen myös kiinnostunut back-endistä ja Fullstackeriksi kehittyminen onkin tulevaisuuden tavoitteeni."],

    "skills__header-1": ["Web Development", "Web-kehitys"],
    "skills__header-2": ["Software Development", "Ohjelmistokehitys"],
    "skills__header-3": ["Programs", "Ohjelmat"],
    "skills__header-4": ["What I want to learn", "Mitä haluan oppia"],

    "projects__header-h2": ["My projects", "Projektit"],
    "projects__card-1--header": ["WordPress site", "WordPress-sivusto"],
    "projects__card-1--type": ["Customer project", "Asiakasprojekti"],
    "projects__card-1__back--header": ["See more!", "Katso lisää!"],
    "projects__card-1__back--text": ["Made as a customer project during my studies. Layout was given to me by a graphic designer.", "Tehty asiakastyönä koulun ohella harjoittelupaikkani kautta.<br />Ulkoasu tehty graafikon antaman layoutin mukaan."],
    "projects__card-1__back--button": ["Site", "Sivusto"],
    "projects__card-2--header": ["WordPress site", "WordPress-sivusto"],
    "projects__card-2--type": ["Customer project", "Asiakasprojekti"],
    "projects__card-2__back--header": ["See more!", "Katso lisää!"],
    "projects__card-2__back--text": ["Made as a customer project during my internship. Layout and building made by me.", "Tehty asiakastyönä harjoittelujaksolla. Ulkoasu ja toteutus minun käsialaani."],
    "projects__card-2__back--button": ["Site", "Sivusto"],
    "projects__card-3--header": ["WordPress site", "WordPress-sivusto"],
    "projects__card-3--type": ["Customer project", "Asiakasprojekti"],
    "projects__card-3__back--header": ["See more!", "Katso lisää!"],
    "projects__card-3__back--text": ["Made as a customer project during my internship. Layout and building made by me.", "Tehty asiakastyönä harjoittelujaksolla. Ulkoasu ja toteutus minun käsialaani."],
    "projects__card-3__back--button": ["Site", "Sivusto"],
    "projects__card-4--header": ["Burger-Builder app", "Burger-Builder app"],
    "projects__card-4--type": ["Course project", "Kurssiprojekti"],
    "projects__card-4__back--header": ["See more!", "Katso lisää!"],
    "projects__card-4__back--text": ["Made as a practice project in React-course.", "Tehty React-kurssin harjoitustyönä."],
    "projects__card-5--header": ["Socket.io Chat", "Socket.io Chat"],
    "projects__card-5--type": ["School project", "Kouluprojekti"],
    "projects__card-5__back--header": ["See more!", "Katso lisää!"],
    "projects__card-5__back--text": ["The final assignment of component programming-course.", "Tehty komponenttiohjelmointi-kurssin lopputyönä."],
    "projects__card-6--header": ["Usermanagement App", "Usermanagement App"],
    "projects__card-6--type": ["Practice project", "Harjoitusprojekti"],
    "projects__card-6__back--header": ["See more!", "Katso lisää!"],
    "projects__card-6__back--text": ["Made as practice on my freetime.", "Tehty harjoitustyönä vapaa-ajalla."],

    "contact__h2": ["Contact me", "Ota yhteyttä"],
    "contact__input-1": ["Full name", "Nimi"],
    "contact__input-2": ["Email", "Email"],
    "contact__input-3": ["Subject", "Aihe"],
    "contact__input-4": ["Message", "Viesti"],
    "contact__button": ["Send", "Lähetä"]
}
